function start() {
    status = -1;
    action(1, 0, 0)
}

function action(mode, type, selection) {
    if (status <= 0 && mode <= 0) {
        cm.dispose();
        return
    }
    if (mode == 1) {
        status++
    } else {
        status--
    }
    if (status <= 0) {
        var
        selStr = "脚本标题\r\n";
        selStr += "#L1#选择项1#l\r\n";
		selStr += "#L2#选择项2#l\r\n";
		selStr += "#L3#选择项3#l\r\n";
		
        cm.sendSimple(selStr)
    } else if (status == 1) {
        switch (selection) {
            case 1:
				cm.sendOk("选择项1");
				//cm.消息(2,“123”);
				cm.判断物品(4010000,5);
				//cm.给金币(1000);
/* 				cm.概率给物品(4002000, 2, 30, "绿蜗牛邮票");
				cm.概率给物品(4007000, 2, 30, "魔法粉末(褐色)");
                cm.概率给物品(4007001, 2, 30, "魔法粉末(白色)");
                cm.概率给物品(4007002, 2, 30, "魔法粉末(蓝色)");
                cm.概率给物品(4007003, 2, 30, "魔法粉末(绿色)");
                cm.概率给物品(4007004, 2, 30, "魔法粉末(黄色)");
                cm.概率给物品(4007005, 2, 30, "魔法粉末(紫色)");
                cm.概率给物品(4007006, 2, 30, "魔法粉末(红色)");
                cm.概率给物品(4007007, 2, 30, "魔法粉末(黑色)");
                cm.概率给物品(4010000, 5, 30, "青铜母矿");
                cm.概率给物品(4010001, 5, 30, "钢铁母矿");
                cm.概率给物品(4010002, 5, 30, "锂矿石母矿");
                cm.概率给物品(4010003, 5, 30, "朱矿石母矿");
                cm.概率给物品(4010004, 5, 30, "银的母矿");
                cm.概率给物品(4010005, 5, 30, "紫矿石母矿");
                cm.概率给物品(4010006, 5, 30, "黄金母矿");
                cm.概率给物品(4010007, 5, 30, "锂母矿"); */
				
				cm.消息(14,"asddaads")
			    //cm.横幅喇叭("测试测试哦",5121010,20)
				
                cm.对话结束();
                break;
			case 2:
				cm.sendOk("选择项2");
                cm.dispose();
                break;
			case 3:
				cm.sendOk("选择项3");
                cm.dispose();
                break;
           
        }
    }
}